#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Author:
# Description:

STORY_YIXI = {
    "zm-3": {
        "title": "逐梦亚军-梦想三部曲",
        "part_ids": ["喜1.2.6", "喜1.5.6", "喜1.9.4"]
    },
    "zm-6": {
        "title": "逐梦亚军-六部作品",
        "part_ids": ["喜1.2.6", "喜1.5.6", "喜1.9.4", "喜1.7.4", "喜1.10.5", "喜1.11.5"]
    },
    "hs-6": {
        "title": "皓史成双-六部曲",
        "part_ids": ["喜1.2.2", "喜1.4.1", "喜1.6.4", "喜1.7.1", "喜1.10.2", "喜1.11.3"]
    },
    "sg-3": {
        "title": "三国三部曲",
        "part_ids": ["喜1.3.11", "喜1.3.2", "喜1.5.3", "喜1.11.1"]
    },
    "ds-5": {
        "title": "大锁x孙天宇5部作品",
        "part_ids": ["喜1.3.1", "喜1.4.4", "喜1.8.5", "喜1.9.3", "喜1.10.3"]
    },
    "3b-8": {
        "title": "三班大斧子-8",
        "part_ids": ["喜1.7.4", "喜1.10.5", "喜1.11.5", "喜1.8.4", "喜1.13.2", "喜1.8.2", "喜1.5.2", "喜1.9.2"]
    },
    "pd-3": {
        "title": "胖达人-3",
        "part_ids": ["喜1.1.3", "喜1.6.3", "喜1.8.3"]
    },
    "3g-4": {
        "title": "三狗4",
        "part_ids": ["喜1.1.4", "喜1.5.1", "喜1.7.2", "喜1.11.4"]
    },
    "z-4": {
        "title": "周铁男四部作品",
        "part_ids": ["喜1.3.3", "喜1.6.2", "喜1.7.5", "喜1.13.3"]
    },
}
