
class Document:
    def __init__(self, document: str):
        self.document = document

def doc_search(query, top_k, libs, kb_ids, kb_file_ids):
    """
    实现检索逻辑，返回List[Document]
    return: List[Document]
    """
    if set(libs)==set(["es_chunk","es_summary","es_embedding","es_summary_embedding"]):
        documents=documents = [
    '第7航空队第607物资维修中队水港联络官达尔文·瓦伦西亚（Darwin Valencia） 美国空军三级军士长、菲律宾裔达尔文·瓦伦西亚担任韩国釜山第607物资维修中队水港联络官，重视家庭，爱好广泛，工作成就显著。个人背景：达尔文·瓦伦西亚是美国空军三级军士长，菲律宾裔，重视家庭与工作。瓦伦西亚个人资料：出生于菲律宾裔，重视家庭，育有三子一女。',
    
    '地举行的巴西柔术比赛。2生活照。2021年11月8日，与家人合照。1.3家庭成员。1.3.1妻子。姓名智熙·金·瓦伦西亚（Jihee Kim Valencia）。照片。智熙·金·瓦伦西亚（Jihee Kim Valencia），系达尔文·瓦伦西亚（Darwin Valencia）的妻子，韩裔，1984。简介年1月出生于，现年39岁。毕业于关岛高中（Guam HighSchool）和关岛大学（University of Guam）。夫妻二人育有三子一女。社交媒体脸谱：https://www.facebook.com/jihee.kimvalencia。1.4生活习惯。达尔文·瓦伦西亚（Darwin·瓦伦西亚）网络获取习惯的。时间主要集中在凌晨1点至2点，早上6点至8点，中午2点。',
    
    '达尔文·瓦伦西亚第7航空队第607物资维修中队水港联络管 2023年3月16日目标概述第607物资维修中队水港联络官达尔文·瓦伦西亚（DarwinValencia，下文简称瓦伦西亚），美国空军三级军士长，男，菲律宾裔，1980年6月出生于关岛，现年42岁， 与妻子智熙·金·瓦伦西亚（Jihee KimValencia）育有三子一女。瓦伦西亚喜欢巴西柔术，也喜欢漫威电影《死侍》。联系邮箱：darwin.s.valencia@gmail.com；电话：（253）709-2368；地址：华盛顿州斯帕纳威201街道5111号。',
    
    "瓦伦西亚大五人格表现为：神经质较低、外倾性一般、尽责性较高、宜人性一般、开放性一般。瓦伦西亚非常重视家庭，组建家庭的愿望是其最初加入空军的动力。 一、自然属性1.1 基本信息 1.2 个人照片1.3 家庭成员1.3.1妻子 1.4生活习惯 达尔文·瓦伦西亚（DarwinValencia）网络获取习惯的时间主要集中在凌晨1点至2点，早上6点至8点，中午2点，下午6点至晚上8点。1.5就医情况 达尔文·瓦伦西亚（DarwinValencia）目前身体状况良好。二、社会属性2.2 教育经历 1999年8月15日-2001年5月，就读于关岛大学(University of Guam) ; 2011年，就读于刘易斯-麦科德联合基地皮尔斯学院(Pierce College at Joint Base Lewis-McChord) ; 2013年6月-2013年11月，圣马丁大学（Saint Martin's University）。2.3宗教信仰 达尔文·瓦伦西亚（DarwinValencia）信仰基督教。2.4联系方式",
    
    '第7航空队第607物资维修中队水港联络官达尔文·瓦伦西亚（Darwin Valencia） 美国空军三级军士长、菲律宾裔达尔文·瓦伦西亚担任韩国釜山第607物资维修中队水港联络官，重视家庭，爱好广泛，工作成就显著。个人背景：达尔文·瓦伦西亚是美国空军三级军士长，菲律宾裔，重视家庭与工作。教育经历：瓦伦西亚接受过多所学校教育，拥有良好教育背景。社交属性：瓦伦西亚发帖频繁，内容正面，有400名左右好友。心理属性与兴趣爱好：瓦伦西亚性格稳定，爱好广泛，注重家庭。工作职责与目标价值综述：瓦伦西亚负责管理运输和联络服务，工作重要，有强烈家庭和国家认同感。',
    
    '第7航空队第607物资维修中队水港联络官达尔文·瓦伦西亚（Darwin Valencia）',
    
    '达尔文·瓦伦西亚第7航空队第607物资维修中队水港联络管 2023年3月16日目标概述第607物资维修中队水港联络官达尔文·瓦伦西亚（DarwinValencia，下文简称瓦伦西亚），美国空军三级军士长，男，菲律宾裔，1980年6月出生于关岛，现年42岁， 与妻子智熙·金·瓦伦西亚（Jihee KimValencia）育有三子一女。瓦伦西亚喜欢巴西柔术，也喜欢漫威电影《死侍》。联系邮箱：darwin.s.valencia@gmail.com；电话：（253）709-2368；地址：华盛顿州斯帕纳威201街道5111号。',
    
    '达尔文·瓦伦西亚第7航空队第607物资维修中队水港联络管 2023年3月16日目标概述第607物资维修中队水港联络官达尔文·瓦伦西亚（DarwinValencia，下文简称瓦伦西亚），美国空军三级军士长，男，菲律宾裔，1980年6月出生于关岛，现年42岁， 与妻子智熙·金·瓦伦西亚（Jihee KimValencia）育有三子一女。瓦伦西亚喜欢巴西柔术，也喜欢漫威电影《死侍》。联系邮箱：darwin.s.valencia@gmail.com；电话：（253）709-2368；地址：华盛顿州斯帕纳威201街道5111号。',
    
    "瓦伦西亚大五人格表现为：神经质较低、外倾性一般、尽责性较高、宜人性一般、开放性一般。瓦伦西亚非常重视家庭，组建家庭的愿望是其最初加入空军的动力。 一、自然属性1.1 基本信息 1.2 个人照片1.3 家庭成员1.3.1妻子 1.4生活习惯 达尔文·瓦伦西亚（DarwinValencia）网络获取习惯的时间主要集中在凌晨1点至2点，早上6点至8点，中午2点，下午6点至晚上8点。1.5就医情况 达尔文·瓦伦西亚（DarwinValencia）目前身体状况良好。二、社会属性2.2 教育经历 1999年8月15日-2001年5月，就读于关岛大学(University of Guam) ; 2011年，就读于刘易斯-麦科德联合基地皮尔斯学院(Pierce College at Joint Base Lewis-McChord) ; 2013年6月-2013年11月，圣马丁大学（Saint Martin's University）。2.3宗教信仰 达尔文·瓦伦西亚（DarwinValencia）信仰基督教。2.4联系方式",
    
    '达尔文·瓦伦西亚（Darwin Valencia）是美国空军第7航空队第607物资维修中队水港联络官，个人背景包括菲律宾裔，强调家庭和工作的重要性。'
]

        docs = [Document(document=doc) for doc in documents]
    #     doc=Document(document="""预防糖尿病一般需要注意控制体重、注意养成良好的生活习惯、进行适度的体育锻炼、控制压力、避免过度饮酒和吸烟；饮食上要注意清淡饮食、注意选择低糖饮食、增加蔬果摄入、选择健康蛋白质、增加膳食纤维摄入。具体分析如下：

    # 一、生活上注意事项

    # 1.注意控制体重：糖尿病是一种代谢性疾病，主要表现为血糖升高。体重超重或肥胖是糖尿病发生的危险因素之一，因此需要通过适当锻炼、健康的饮食来控制体重。

    # 2.注意养成良好的生活习惯：日常生活中要保持规律的生活方式，避免过度疲劳，保持心情愉悦，有利于预防糖尿病。

    # 3.进行适度的体育锻炼：定期进行适度的有氧运动，如快走、跑步、游泳等，可以帮助提高身体的胰岛素敏感性，降低糖尿病的风险。

    # """)
    #     return [doc]*10
    elif set(libs)==set(["es_chunk","es_embedding"]):
        documents=[{"id": 453804119387338235, "text": " jade@klcc.gov。 marcellin2076@hotmail.com。 社交账号\n脸书：https://www.facebook.com/profile.php。id=692487429。姓名 赵又洁。出生日期 2005-06-25。身份证号 A231469587。户籍号 Y8121923。3/18", "label": "<TERMINATE>", "info": "赵又洁出生日期2005-06-25", "chunk_text_type": "milvus_chunk"}, {"id": 453804119387334813, "text": " 出生日期 1948年12月8日。 出生地 中国广东省广州市。 21\n职务 香港企业家，佐丹奴、香港苹果日报、壹传媒创办人。关联关系：。黎智英是朱凯迪支持者。2016 年立法会选举，黎智英大。撒黑钱，让部分“温和”候选人退选，并通过从美国引进的。配票软件，组织激进选民投票。一番操作之下，民调排在末。位的朱凯迪成功逆袭，以“票王”之姿顺利当选议员。当选。后的朱凯迪自然投桃报李，在多次乱港行动中甘做马前卒。。（2）陈允中。姓名 陈允中。别称 YC。祖籍 湖南长沙。出生日期 1970年。出生地 砂拉越州诗巫。职务 马来西亚文化研究学者。母校", "label": "<TERMINATE>", "info": "1948年12月8日", "chunk_text_type": "milvus_chunk"}, {"id": 453804119387337715, "text": " 就职日期 2019年1月14日。 照片。 出生日期 1964年2月3日\n就职日期 2019年1月14日。照片。出生日期 1964年2月3日。身份证号 A123440192。户籍号 YE564596。1 https://readers.ctee.com.tw/cm/20200124/a04aa4/1037245/share", "label": "<TERMINATE>", "info": "日期1964年2月3日", "chunk_text_type": "milvus_chunk"}, {"id": 453804119387333967, "text": " JP。 陈勇，BBS，JP（英语：Brave ChanYung，1969年 9 月 24 日－），祖籍福。 建省，香港社会工作者及政治人物\n建省，香港社会工作者及政治人物。现任新界社团联会（新社联）理事长、民主。建港协进联盟副主席、第十二届及第十三届港区全国人大代表。于2008年至2015。年期间任北区区议会委任议员，任内担任社会服务、劳工及经济事务委员会委员，。亦为香港专业及资深行政人员协会成员、曾担任公民教育委员会委员（2010 年。至2014年）。。郑松岩。本报告由颐信科技有限公司独家调查编写，请严格保密，只供领导小组参阅，不得对外传播，以保证。情报线索不被反侦查。。8/85", "label": "<TERMINATE>", "info": "1969年9月24日", "chunk_text_type": "milvus_chunk"}, {"id": 453804119387349078, "text": " https://www.guancha.cn/WangShaoGuang/2019_03_25_494972_s.shtml。 研究方向 政治经济学，中国政治，东亚新兴工业经济体，中央-地方关系，民主理。 56/114\n论与实践。。4.1.5 史景迁（Jonathan Dermot Spence）。史景迁是沈旭晖在耶鲁大学的历史学导师。。姓名 JonathanDermotSpence。中文 史景迁（史景迁一名为房兆楹所命，其原义为“景仰司马迁”）。出生日 1936年8月11日。期。出生地 英国伦敦。学历 剑桥大学克莱尔学院获得学士学位。耶鲁大学史学博士学位。工作经 1965年毕业后留在耶鲁教书。。历 美国历史学会2004年-2005年的主席。。他的研究使得他经常访问中国的大学。。学术思 史景迁研究中国历史半生，对中国近代史的开端时间有与中国史学界不同的看。想", "label": "<TERMINATE>", "info": "史景迁生日1936年8月11日", "chunk_text_type": "milvus_chunk"}, {"id": 453804119387327953, "text": " jade@klcc.gov。 marcellin2076@hotmail.com。 社交账号\n脸书：https://www.facebook.com/profile.php。id=692487429。姓名 赵又洁。出生日期 2005-06-25。身份证号 A231469587。户籍号 Y8121923。3 / 18", "label": "<TERMINATE>", "info": "赵又洁出生日期2005-06-25", "chunk_text_type": "milvus_chunk"}, {"id": 453804119387349083, "text": " 艰涩的名词，但他生动的叙事，完全可以迎合史学界随后学而起“叙事再生”。 （RevivalofNarrative）的呼声，使他成为史学叙事再生后的一支生力军”，“他的。 57/114\n作品作为历史文章毕竟缺乏分析与论证，也少见他对历史问题提出独特的解释。。因而虽多引人入胜的故事，却少扎实的历史知识。”据称钱锺书当年访问耶鲁时。私下戏称史景迁为“失败的小说家”。。4.1.6 赵志裕。沈旭晖的创业思维曾受社科院院长赵志裕影响。。姓名 赵志裕。英文名 ChiuChiYue。民族 汉族。出生 1966年。教育 香港大学、哥伦比亚大学。现任香港中文大学社会科学院全职院长，卓敏心理学讲座教授，中国文化。研究所中国研究服务中心主任。。曾任新加披南洋理工大学商学院教授兼研究院主任、文化研究所所长及亚。职位", "label": "<TERMINATE>", "info": "赵志裕出生1966年", "chunk_text_type": "milvus_chunk"}, {"id": 453804119387332038, "text": " 生日 1993年10月8日。 父亲 刘伟权。 母亲\n刘颖匡（VentusLauWing-hong）。生日 1993年10月8日。父亲 刘伟权。母亲 刘宝珠（屯门友爱村爱明楼2020室）。家庭住址 屯门友爱村爱明楼2620室。国籍 中国（香港）。新民主同盟成员，沙田社区网络成员，曾任香港中文大学善衡书院学生会代。职务。表会主席。Facebook（个人）：https://www.facebook.com/lauwinghong。社交媒体。Facebook（公共）：https://www.facebook.com/lauwinghong。7.柯耀林", "label": "<TERMINATE>", "info": "生日1993年10月8日", "chunk_text_type": "milvus_chunk"}, {"id": 453804119387332057, "text": " lichiwangdcoffice@gmail.com。 16.赵柱帮。 姓名 赵柱帮（ChiuChuPong）\n16.赵柱帮。姓名 赵柱帮（ChiuChuPong）。别称 Sunny、帮主、趙柱幫。生日 1992年9月2日。电话号码 63471955、37099071。传真号码 37099073。国籍 中国（香港）。办公地址 沙田博康邨博逸楼地下1号。职务 沙田区博康选区议会议员，地区设施管理及保安事务委员会主席，文化、体。50", "label": "<TERMINATE>", "info": "赵柱生日1992年9月2日", "chunk_text_type": "milvus_chunk"}, {"id": 453804119387337922, "text": " 人陈贞。 强。 7\nhttps://vip.udn.com/vip/story/121939/5399021。https://tw.news.yahoo.com/%E5%85%A7%E9%96%A3%E6%94%B9%E7%B5%84%E7%95%99%E4%B8%8B%E9%80%99%E。7%BE%A4%E4%BA%BA-%E5%8F%B0%E5%A4%A7%E6%94%BF%E6%B2%BB%E7%B3%BB%E6%95%99%E6%8E%88%E7%9C%。8B%E5%87%BA%E8%94%A1%E8%8B%B1%E6%96%87%E6%83%B3%E5%B9%B9%E4%BB%80%E9%BA%BC-", "label": "<TERMINATE>", "info": "尔人t", "chunk_text_type": "milvus_chunk"}]

        docs=[Document(document=doc["text"]) for doc in documents]
        
    return docs


def extract_docs(docs: list[Document]):

    doc_strs = [doc.document for doc in docs]
    return doc_strs

def doc_search_main(query, top_k, libs, kb_ids, kb_file_ids):

    docs = doc_search(query=query, top_k=top_k, libs=libs, kb_ids=kb_ids, kb_file_ids=kb_file_ids)
    #doc_strs = extract_docs(docs)
    return docs
