#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Author:
# Description:


EPISODE_MOS_DATA = {
    "S01E01": {
        "title": "郭女侠怒砸同福店，佟掌柜妙点迷路人",
        "bed": [(0, 0), (0, "00:01:47"), ("00:45:26", 300)],
    },
    "S01E02": {
        "title": "掌柜的慰问装病者，跑堂人收拾寻衅女",
        "bed": [(0, 0), (0, "00:01:46"), ("00:45:00", 300)],
    },
    "S01E03": {
        "title": "众伙计沦为小跟班，莫小贝建起八大派",
        "bed": [(0, 0), (0, "00:01:46"), ("00:45:00", 300)],
    },
    "S01E04": {
        "title": "李厨子智斗瞎老娘，白盗圣惨遇赌大王",
        "bed": [(0, 0), (0, "00:01:46"), ("00:45:14", 300)],
    },
    "S01E05": {
        "title": "展红绫千里追扒手，郭芙蓉一心迷盗圣",
        "bed": [(0, 0), (0, "00:01:46"), ("00:44:47", 300)],
    },
    "S01E06": {
        "title": "杨蕙兰比武招郎君，李大嘴施招毙煞神",
        "bed": [(0, 0), (0, "00:01:46"), ("00:45:10", 300)],
    },
    "S01E07": {
        "title": "讨银钱秀才苦费心，泄私愤芙蓉恶作剧",
        "bed": [(0, 0), (0, "00:01:46"), ("00:44:39", 300)],
    },
    "S01E08": {
        "title": "七侠古镇寡妇寻夫，尚儒客栈众人聚首",
        "bed": [(0, 0), (0, "00:01:46"), ("00:45:05", 300)],
    },
    "S01E09": {
        "title": "佟湘玉煞费良苦心，莫小贝梦游影视城",
        "bed": [(0, 0), (0, "00:01:46"), ("00:44:58", 300)],
    },
    "S01E10": {
        "title": "壮怂胆捕头喝烈酒，施恩惠秀才偷剩菜",
        "bed": [(0, 0), (0, "00:01:46"), ("00:43:32", 300)],
    },
    "S01E11": {
        "title": "瘪十娘撒娇勾展堂，赛貂蝉耍赖讹湘玉",
        "bed": [(0, 0), (0, "00:01:46"), ("00:45:03", 300)],
    },
    "S01E12": {
        "title": "受委屈伙计装叛变，求生意老板充大方",
        "bed": [(0, 0), (0, "00:01:46"), ("00:44:22", 300)],
    },
    "S01E13": {
        "title": "争自尊大嘴扮文豪，解危难湘玉设大局"
    },
    "S01E14": {
        "title": "邢捕头勇破杀鸡案，燕小六力推防贼法"
    },
    "S01E15": {
        "title": "雷老五潜入县衙门，佟掌柜钻进牛角尖"
    },
    "S01E16": {
        "title": "为骗财书商耍手段，欲销赃掌柜吓破胆"
    },
    "S01E17": {
        "title": "莫小贝初学衡山派，钱夫人再闹同福店"
    },
    "S01E18": {
        "title": "燕小六酒醉乱抓人，郭芙蓉心痴错定情"
    },
    "S01E19": {
        "title": "李大嘴苦练降龙掌，郭芙蓉难逃生死劫"
    },
    "S01E20": {
        "title": "泼皮侯三搅和客栈，女侠芙蓉操办过年"
    },
    "S01E21": {
        "title": "寻短见老五见魔女，赌怨气小郭教武功"
    },
    "S01E22": {
        "title": "佟石头初尝爱滋味，江小道惨遇无心剑"
    },
    "S01E23": {
        "title": "拼厨艺大嘴成巧妇，玩卦象秀才遇良师"
    },
    "S01E24": {
        "title": "算命人作法被识破，郭芙蓉洗面遭毁容"
    },
    "S01E25": {
        "title": "佟老爹怒嫁不孝女，白展堂误娶无情人"
    },
    "S01E26": {
        "title": "求休书小郭盼断肠，思佳人秀才伤透心",
        "bed": [(0, 0), (0, "00:01:46"), ("00:44:50", 300)],
    },
    "S01E27": {
        "title": "入丐帮老邢丢公职，升捕头小六打官腔"
    },
    "S01E28": {
        "title": "钱夫人贪财生毒计，莫小贝雪耻怒报官"
    },
    "S01E29": {
        "title": "吕圣人智斗姬无命，佟掌柜火拼展红绫"
    },
    "S01E30": {
        "title": "佟石头离乡闯江湖，郭芙蓉回家探父母"
    },
    "S01E31": {
        "title": "痴秀才思念郭芙蓉，醋湘玉刁难祝无双"
    },
    "S01E32": {
        "title": "拼创意新菜争状元，斗智慧盗圣巧布局"
    },
    "S01E33": {
        "title": "西域客欲擒关中侠，涉奇险盗圣救人质"
    },
    "S01E34": {
        "title": "受邀请小贝赴衡山，为情困秀才抱错人"
    },
    "S01E35": {
        "title": "小魔女执意做红娘，佟湘玉一心修剑谱"
    },
    "S01E36": {
        "title": "遇克星盗圣吓破胆，赌怨气小郭教武功"
    },
    "S01E37": {
        "title": "心不甘小郭拼才艺，情不愿无双走天涯"
    },
    "S01E38": {
        "title": "受邀请小贝赴衡山，为情困秀才抱错人"
    },
    "S01E39": {
        "title": "吕秀才得理不饶人，郭芙蓉心痴错定情"
    },
    "S01E40": {
        "title": "庆中秋好梦一日游，历磨难客栈重聚首"
    },
    "S01E41": {
        "title": "痴情汉重逢梦中人，糊涂女初识菜刀门"
    },
    "S01E42": {
        "title": "燕小六大摆迷魂阵，千面人关底显真身"
    },
    "S01E43": {
        "title": "恶婆婆率众闹洞房，善媳妇受虐一身伤"
    },
    "S01E44": {
        "title": "吕秀才误收嗜血徒，白展堂临终吐心声"
    },
    "S01E45": {
        "title": "通缉犯转眼成病患，阶下囚洗心重做人"
    },
    "S01E46": {
        "title": "神秘客夜访七侠镇，莫掌门血战灯市街"
    },
    "S01E47": {
        "title": "小姐妹重逢暗叫劲，老夫妻患难见真情"
    },
    "S01E48": {
        "title": "败家女随口开条件，穷哥俩合伙办武馆"
    },
    "S01E49": {
        "title": "慕容嫣专访莫掌门，吕秀才定义真侠士"
    },
    "S01E50": {
        "title": "佟石头离乡闯江湖，郭芙蓉回家探父母"
    },
    "S01E51": {
        "title": "采花盗意外现真身，虎外甥作媒攀良缘"
    },
    "S01E52": {
        "title": "佟石头初尝爱滋味，江小道惨遇无心剑"
    },
    "S01E53": {
        "title": "展侍卫私放真刺客，祝无双迷倒假盗圣"
    },
    "S01E54": {
        "title": "吕秀才误收嗜血徒，白展堂临终吐心声"
    },
    "S01E55": {
        "title": "佟湘玉误毁古剑谱，老画师独创衡山剑"
    },
    "S01E56": {
        "title": "醉宝玉私吞抵押钱，冷县长怒解连环案"
    },
    "S01E57": {
        "title": "李大嘴伪装小女生，白展堂深陷玫瑰劫"
    },
    "S01E58": {
        "title": "小师妹现身七侠镇，大师姐难解心头愤"
    },
    "S01E59": {
        "title": "佟石头无心插柳柳成荫，祝无双错有错着害相思"
    },
    "S01E60": {
        "title": "郭蔷薇信口传谣言，燕小六夜祭一二三"
    },
    "S01E61": {
        "title": "前女友盘查私房钱，局外人识破苦肉计"
    },
    "S01E62": {
        "title": "旧爱已成如烟往事，新欢直面惨淡人生"
    },
    "S01E63": {
        "title": "白展堂重回老地方，佟湘玉折磨新跑堂"
    },
    "S01E64": {
        "title": "白展堂受累入冤狱，王豆豆为爱跑断腿"
    },
    "S01E65": {
        "title": "小跑堂患上失忆症，老情人千里送相思"
    },
    "S01E66": {
        "title": "郭蔷薇信口传谣言，燕小六夜祭一二三"
    },
    "S01E67": {
        "title": "吕秀才练成点穴手，郭芙蓉含恨归故里"
    },
    "S01E68": {
        "title": "祝无双诚觅心上人，辛普森设计娶贤妻"
    },
    "S01E69": {
        "title": "佟掌柜收到诅咒信，马大师梦断同福店"
    },
    "S01E70": {
        "title": "赛貂蝉沦为小丫鬟，佟湘玉卖店赎仇人"
    },
    "S01E71": {
        "title": "吕秀才误上贼船，李大嘴辞别无情人"
    },
    "S01E72": {
        "title": "佟湘玉误毁古剑谱，老画师独创衡山剑"
    },
    "S01E73": {
        "title": "李大嘴遭遇老情敌，杨蕙兰展开新人生"
    },
    "S01E74": {
        "title": "柳星雨夜遇莽郎君，李大嘴情定美娇娘"
    },
    "S01E75": {
        "title": "李大嘴拒演凤求凰，燕小六假礼寄真情"
    },
    "S01E76": {
        "title": "莫小贝街头遭绑架，燕小六智擒假绑匪"
    },
    "S01E77": {
        "title": "谢捕头盘查店中人，钱夫人巧取同福店"
    },
    "S01E78": {
        "title": "杨蕙兰酒后诉衷肠，杜子俊夜访同福店"
    },
    "S01E79": {
        "title": "李大嘴遭遇老情敌，杨蕙兰展开新人生"
    },
    "S01E80": {
        "title": "燕小六接到调职令，凌腾云夜袭同福店"
    }
}
EPISODE_HUANLE = {
    "S01E01": {
        "title": "仨掌门传位弑叛徒，众少侠保命多山庄",
        "bed": [(0, 0), (0, "00:02:25"), ("00:43:28", 300)],
    },
    "S01E02": {
        "title": "郭大路当剑追脏银，林太平下药搅饭局",
        "bed": [(0, 0), (0, "00:02:12"), ("00:44:06", 300)],
    },
    "S01E03": {
        "title": "燕侦探执意查人犯，郭打杂无端丢饭碗",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:43", 300)],
    },
    "S01E04": {
        "title": "鬼公子设计杀少侠，郭大路破局进山庄",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:59", 300)],
    },
    "S01E05": {
        "title": "千面侠点背挨闷棍，玉魔头如愿会郎君",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:03", 300)],
    },
    "S01E06": {
        "title": "鹰隼帮嫁祸百佬会，小仙仙励志林大侠",
        "bed": [(0, 0), (0, "00:02:12"), ("00:41:55", 300)],
    },
    "S01E07": {
        "title": "玉姑娘挑衅红教坊，鬼公子唬弄郭少侠",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:29", 300)],
    },
    "S01E08": {
        "title": "郭大路痛殴千面侠，南宫丑自投天罗网",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:12", 300)],
    },
    "S01E09": {
        "title": "仨掌门英明识奸计",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:38", 300)],
    },
    "S01E10": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:25"), ("00:41:57", 300)],
    },
    "S01E11": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:44:33", 300)],
    },
    "S01E12": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:44:18", 300)],
    },
    "S01E13": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:52", 300)],
    },
    "S01E14": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:00", 300)],
    },
    "S01E15": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:42", 300)],
    },
    "S01E16": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:44:50", 300)],
    },
    "S01E17": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:45:13", 300)],
    },
    "S01E18": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:45:49", 300)],
    },
    "S01E19": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:44:41", 300)],
    },
    "S01E20": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:44:58", 300)],
    },
    "S01E21": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:41:52", 300)],
    },
    "S01E22": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:25"), ("00:41:12", 300)],
    },
    "S01E23": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:23", 300)],
    },
    "S01E24": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:39", 300)],
    },
    "S01E25": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:23", 300)],
    },
    "S01E26": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:24"), ("00:43:39", 300)],
    },
    "S01E27": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:39", 300)],
    },
    "S01E28": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:38", 300)],
    },
    "S01E29": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:41:53", 300)],
    },
    "S01E30": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:14", 300)],
    },
    "S01E31": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:30", 300)],
    },
    "S01E32": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:21", 300)],
    },
    "S01E33": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:31", 300)],
    },
    "S01E34": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:07", 300)],
    },
    "S01E35": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:24"), ("00:43:02", 300)],
    },
    "S01E36": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:41:53", 300)],
    },
    "S01E37": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:41:57", 300)],
    },
    "S01E38": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:01", 300)],
    },
    "S01E39": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:24"), ("00:41:50", 300)],
    },
    "S01E40": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:41:50", 300)],
    },
    "S01E41": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:29", 300)],
    },
    "S01E42": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:32", 300)],
    },
    "S01E43": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:36", 300)],
    },
    "S01E44": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:53", 300)],
    },
    "S01E45": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:46", 300)],
    },
    "S01E46": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:40", 300)],
    },
    "S01E47": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:09", 300)],
    },
    "S01E48": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:05", 300)],
    },
    "S01E49": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:42:10", 300)],
    },
    "S01E50": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:43:12", 300)],
    },
    "S01E51": {
        "title": "",
        "bed": [(0, 0), (0, "00:02:12"), ("00:44:01", 300)],
    },
}
