{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[MASK]": 3,
      "[UNK]": 4,
      "[EOS]": 5,
      "A": 6,
      "C": 7,
      "D": 8,
      "E": 9,
      "F": 10,
      "G": 11,
      "H": 12,
      "I": 13,
      "K": 14,
      "L": 15,
      "M": 16,
      "N": 17,
      "P": 18,
      "Q": 19,
      "R": 20,
      "S": 21,
      "T": 22,
      "V": 23,
      "W": 24,
      "Y": 25,
      "Ċ": 26,
      "Ġ": 27,
      "ĠC": 28,
      "ĠCA": 29,
      "ĠCAS": 30,
      "ĠCASS": 31,
      "YF": 32,
      "QYF": 33,
      "FF": 34,
      "GG": 35,
      "TQYF": 36,
      "ĠCS": 37,
      "EQ": 38,
      "SG": 39,
      "EQYF": 40,
      "TG": 41,
      "EQFF": 42,
      "ĠCASSL": 43,
      "TF": 44,
      "RG": 45,
      "ĠCSA": 46,
      "DTQYF": 47,
      "AG": 48,
      "NEQFF": 49,
      "HF": 50,
      "LFF": 51,
      "EA": 52,
      "YEQYF": 53,
      "YTF": 54,
      "TS": 55,
      "QG": 56,
      "PG": 57,
      "PL": 58,
      "ETQYF": 59,
      "RD": 60,
      "EAFF": 61,
      "GYTF": 62,
      "PQ": 63,
      "TDTQYF": 64,
      "SS": 65,
      "ELFF": 66,
      "YNEQFF": 67,
      "NT": 68,
      "VL": 69,
      "LA": 70,
      "LG": 71,
      "ĠCSV": 72,
      "PQHF": 73,
      "RA": 74,
      "EG": 75,
      "YGYTF": 76,
      "QPQHF": 77,
      "VG": 78,
      "ĠCASSQ": 79,
      "IS": 80,
      "EK": 81,
      "LL": 82,
      "ĠCASR": 83,
      "PLHF": 84,
      "ĠCASSP": 85,
      "TGELFF": 86,
      "ĠCATS": 87,
      "AN": 88,
      "SPLHF": 89,
      "RS": 90,
      "RT": 91,
      "RL": 92,
      "ĠCASSS": 93,
      "EKLFF": 94,
      "RV": 95,
      "PS": 96,
      "NQPQHF": 97,
      "NTEAFF": 98,
      "QETQYF": 99,
      "ĠCASSY": 100,
      "RE": 101,
      "TSG": 102,
      "IYF": 103,
      "NI": 104,
      "AS": 105,
      "ĠCAIS": 106,
      "ĠCASSF": 107,
      "AL": 108,
      "TL": 109,
      "SL": 110,
      "DG": 111,
      "NTIYF": 112,
      "VLTF": 113,
      "ĠCASSE": 114,
      "NSPLHF": 115,
      "TEAFF": 116,
      "ANVLTF": 117,
      "IG": 118,
      "PP": 119,
      "DS": 120,
      "RR": 121,
      "GGG": 122,
      "VS": 123,
      "NIQYF": 124,
      "EL": 125,
      "KG": 126,
      "AA": 127,
      "ĠCASSLG": 128,
      "TGG": 129,
      "ĠS": 130,
      "WG": 131,
      "ĠCAST": 132,
      "DL": 133,
      "RP": 134,
      "IL": 135,
      "ES": 136,
      "VA": 137,
      "TA": 138,
      "TN": 139,
      "LAG": 140,
      "ĠCSARD": 141,
      "DR": 142,
      "ĠCASG": 143,
      "LS": 144,
      "FG": 145,
      "ĠA": 146,
      "RQ": 147,
      "PA": 148,
      "NYGYTF": 149,
      "ĠG": 150,
      "RGG": 151,
      "ĠL": 152,
      "YG": 153,
      "NTGELFF": 154,
      "ĠCAW": 155,
      "ĠK": 156,
      "ĠCAI": 157,
      "TV": 158,
      "DRG": 159,
      "KNIQYF": 160,
      "ĠCASSV": 161,
      "YS": 162,
      "TP": 163,
      "SGANVLTF": 164,
      "ĠCASSG": 165,
      "AGG": 166,
      "DP": 167,
      "EV": 168,
      "MG": 169,
      "LAGG": 170,
      "ĠV": 171,
      "SYEQYF": 172,
      "RN": 173,
      "ĠCSAS": 174,
      "KL": 175,
      "RI": 176,
      "SGNTIYF": 177,
      "ĠCAT": 178,
      "ĠF": 179,
      "YL": 180,
      "ĠCSVE": 181,
      "QL": 182,
      "PV": 183,
      "PR": 184,
      "NL": 185,
      "ĠCASSA": 186,
      "ĠCSAR": 187,
      "NG": 188,
      "TD": 189,
      "ĠI": 190,
      "HL": 191,
      "QGA": 192,
      "ĠCASSLA": 193,
      "FL": 194,
      "FS": 195,
      "HG": 196,
      "RTG": 197,
      "YNSPLHF": 198,
      "QA": 199,
      "NS": 200,
      "ĠY": 201,
      "VV": 202,
      "ĠCASSD": 203,
      "EI": 204,
      "ĠCASSQD": 205,
      "SSYNEQFF": 206,
      "DEQFF": 207,
      "RK": 208,
      "NEKLFF": 209,
      "TI": 210,
      "TYEQYF": 211,
      "DEQYF": 212,
      "TE": 213,
      "TR": 214,
      "GGA": 215,
      "SYNEQFF": 216,
      "ĠCASSI": 217,
      "ĠR": 218,
      "ĠM": 219,
      "ĠCASSPG": 220,
      "SA": 221,
      "PK": 222,
      "EE": 223,
      "ĠCATSD": 224,
      "SV": 225,
      "PD": 226,
      "ĠH": 227,
      "QGG": 228,
      "PI": 229,
      "NEQYF": 230,
      "QFF": 231,
      "QS": 232,
      "DI": 233,
      "RF": 234,
      "PE": 235,
      "QV": 236,
      "TK": 237,
      "SSYEQYF": 238,
      "RQG": 239,
      "ĠCASN": 240,
      "ĠCASSYS": 241,
      "AV": 242,
      "ĠCASK": 243,
      "MNTEAFF": 244,
      "TY": 245,
      "RAG": 246,
      "PGG": 247,
      "ĠCASSLV": 248,
      "ĠCASSH": 249,
      "PF": 250,
      "ĠCAISE": 251,
      "ĠCASSQG": 252,
      "ĠE": 253,
      "SGS": 254,
      "TT": 255,
      "ĠN": 256,
      "RY": 257,
      "ADTQYF": 258,
      "TNEKLFF": 259,
      "LV": 260,
      "ED": 261,
      "ĠQ": 262,
      "ĠD": 263,
      "RETQYF": 264,
      "ĠCASSLD": 265,
      "ĠCASSLS": 266,
      "STDTQYF": 267,
      "PY": 268,
      "TSGG": 269,
      "HEQYF": 270,
      "ĠCSVG": 271,
      "IA": 272,
      "KS": 273,
      "KA": 274,
      "PT": 275,
      "WD": 276,
      "NNEQFF": 277,
      "HS": 278,
      "PYEQYF": 279,
      "PGQG": 280,
      "ĠCSARG": 281,
      "ĠCASRG": 282,
      "ĠCASSR": 283,
      "ĠT": 284,
      "ĠCAWS": 285,
      "ĠCATSRD": 286,
      "ĠCASSLE": 287,
      "ĠCASSSG": 288,
      "II": 289,
      "ML": 290,
      "EETQYF": 291,
      "KV": 292,
      "PN": 293,
      "ĠCASST": 294,
      "PSG": 295,
      "ER": 296,
      "QD": 297,
      "VD": 298,
      "AD": 299,
      "PH": 300,
      "VI": 301,
      "LD": 302,
      "GGS": 303,
      "KK": 304,
      "TGA": 305,
      "AGA": 306,
      "ĠCASI": 307,
      "ĠCAISES": 308,
      "TQ": 309,
      "ĠCSG": 310,
      "ĠCASSEG": 311,
      "RDRG": 312,
      "EN": 313,
      "TGS": 314,
      "VF": 315,
      "RW": 316,
      "ĠCASSW": 317,
      "ĠCASSVG": 318,
      "ĠCASSPL": 319,
      "EF": 320,
      "KI": 321,
      "EY": 322,
      "REG": 323,
      "ĠCSAG": 324,
      "GGL": 325,
      "PPG": 326,
      "TGL": 327,
      "RH": 328,
      "QI": 329,
      "PRG": 330,
      "RRG": 331,
      "PW": 332,
      "TH": 333,
      "VK": 334,
      "MA": 335,
      "PDTQYF": 336,
      "SGG": 337,
      "TGV": 338,
      "AGELFF": 339,
      "ĠCASSK": 340,
      "RTDTQYF": 341,
      "WA": 342,
      "RTSG": 343,
      "AGV": 344,
      "ĠCASSFG": 345,
      "EGG": 346,
      "ET": 347,
      "RDG": 348,
      "RGL": 349,
      "ĠCASA": 350,
      "RGA": 351,
      "YI": 352,
      "MS": 353,
      "QK": 354,
      "RSG": 355,
      "ĠCAG": 356,
      "TGD": 357,
      "PLG": 358,
      "ĠCSARA": 359,
      "ĠCASSLL": 360,
      "YV": 361,
      "ĠCASSEA": 362,
      "ĠCSARV": 363,
      "TYNEQFF": 364,
      "AI": 365,
      "VLG": 366,
      "RDS": 367,
      "DNEQFF": 368,
      "RGS": 369,
      "DF": 370,
      "CL": 371,
      "WS": 372,
      "DGYTF": 373,
      "WL": 374,
      "IF": 375,
      "GGYTF": 376,
      "RPG": 377,
      "DV": 378,
      "YSNQPQHF": 379,
      "AFF": 380,
      "ĠCASSLGG": 381,
      "QE": 382,
      "REQYF": 383,
      "ĠCASSRG": 384,
      "ĠLL": 385,
      "AGL": 386,
      "PTG": 387,
      "ĠCASSQE": 388,
      "QGS": 389,
      "IK": 390,
      "IV": 391,
      "DY": 392,
      "RAL": 393,
      "MV": 394,
      "ASG": 395,
      "QN": 396,
      "RDTQYF": 397,
      "PGL": 398,
      "ANTGELFF": 399
    },
    "merges": [
      "Ġ C",
      "ĠC A",
      "ĠCA S",
      "ĠCAS S",
      "Y F",
      "Q YF",
      "F F",
      "G G",
      "T QYF",
      "ĠC S",
      "E Q",
      "S G",
      "E QYF",
      "T G",
      "EQ FF",
      "ĠCASS L",
      "T F",
      "R G",
      "ĠCS A",
      "D TQYF",
      "A G",
      "N EQFF",
      "H F",
      "L FF",
      "E A",
      "Y EQYF",
      "Y TF",
      "T S",
      "Q G",
      "P G",
      "P L",
      "E TQYF",
      "R D",
      "EA FF",
      "G YTF",
      "P Q",
      "T DTQYF",
      "S S",
      "E LFF",
      "Y NEQFF",
      "N T",
      "V L",
      "L A",
      "L G",
      "ĠCS V",
      "PQ HF",
      "R A",
      "E G",
      "Y GYTF",
      "Q PQHF",
      "V G",
      "ĠCASS Q",
      "I S",
      "E K",
      "L L",
      "ĠCAS R",
      "PL HF",
      "ĠCASS P",
      "TG ELFF",
      "ĠCA TS",
      "A N",
      "S PLHF",
      "R S",
      "R T",
      "R L",
      "ĠCASS S",
      "EK LFF",
      "R V",
      "P S",
      "N QPQHF",
      "NT EAFF",
      "Q ETQYF",
      "ĠCASS Y",
      "R E",
      "T SG",
      "I YF",
      "N I",
      "A S",
      "ĠCA IS",
      "ĠCASS F",
      "A L",
      "T L",
      "S L",
      "D G",
      "NT IYF",
      "VL TF",
      "ĠCASS E",
      "N SPLHF",
      "T EAFF",
      "AN VLTF",
      "I G",
      "P P",
      "D S",
      "R R",
      "GG G",
      "V S",
      "NI QYF",
      "E L",
      "K G",
      "A A",
      "ĠCASSL G",
      "T GG",
      "Ġ S",
      "W G",
      "ĠCAS T",
      "D L",
      "R P",
      "I L",
      "E S",
      "V A",
      "T A",
      "T N",
      "L AG",
      "ĠCSA RD",
      "D R",
      "ĠCAS G",
      "L S",
      "F G",
      "Ġ A",
      "R Q",
      "P A",
      "N YGYTF",
      "Ġ G",
      "R GG",
      "Ġ L",
      "Y G",
      "N TGELFF",
      "ĠCA W",
      "Ġ K",
      "ĠCA I",
      "T V",
      "D RG",
      "K NIQYF",
      "ĠCASS V",
      "Y S",
      "T P",
      "SG ANVLTF",
      "ĠCASS G",
      "A GG",
      "D P",
      "E V",
      "M G",
      "LA GG",
      "Ġ V",
      "S YEQYF",
      "R N",
      "ĠCSA S",
      "K L",
      "R I",
      "SG NTIYF",
      "ĠCA T",
      "Ġ F",
      "Y L",
      "ĠCSV E",
      "Q L",
      "P V",
      "P R",
      "N L",
      "ĠCASS A",
      "ĠCSA R",
      "N G",
      "T D",
      "Ġ I",
      "H L",
      "QG A",
      "ĠCASSL A",
      "F L",
      "F S",
      "H G",
      "R TG",
      "Y NSPLHF",
      "Q A",
      "N S",
      "Ġ Y",
      "V V",
      "ĠCASS D",
      "E I",
      "ĠCASSQ D",
      "SS YNEQFF",
      "D EQFF",
      "R K",
      "N EKLFF",
      "T I",
      "T YEQYF",
      "D EQYF",
      "T E",
      "T R",
      "GG A",
      "S YNEQFF",
      "ĠCASS I",
      "Ġ R",
      "Ġ M",
      "ĠCASS PG",
      "S A",
      "P K",
      "E E",
      "ĠCATS D",
      "S V",
      "P D",
      "Ġ H",
      "Q GG",
      "P I",
      "N EQYF",
      "Q FF",
      "Q S",
      "D I",
      "R F",
      "P E",
      "Q V",
      "T K",
      "SS YEQYF",
      "R QG",
      "ĠCAS N",
      "ĠCASSY S",
      "A V",
      "ĠCAS K",
      "M NTEAFF",
      "T Y",
      "R AG",
      "P GG",
      "ĠCASSL V",
      "ĠCASS H",
      "P F",
      "ĠCAIS E",
      "ĠCASS QG",
      "Ġ E",
      "SG S",
      "T T",
      "Ġ N",
      "R Y",
      "A DTQYF",
      "TN EKLFF",
      "L V",
      "E D",
      "Ġ Q",
      "Ġ D",
      "R ETQYF",
      "ĠCASSL D",
      "ĠCASSL S",
      "S TDTQYF",
      "P Y",
      "TS GG",
      "H EQYF",
      "ĠCSV G",
      "I A",
      "K S",
      "K A",
      "P T",
      "W D",
      "N NEQFF",
      "H S",
      "P YEQYF",
      "PG QG",
      "ĠCSA RG",
      "ĠCAS RG",
      "ĠCASS R",
      "Ġ T",
      "ĠCAW S",
      "ĠCATS RD",
      "ĠCASSL E",
      "ĠCASS SG",
      "I I",
      "M L",
      "E ETQYF",
      "K V",
      "P N",
      "ĠCASS T",
      "P SG",
      "E R",
      "Q D",
      "V D",
      "A D",
      "P H",
      "V I",
      "L D",
      "GG S",
      "K K",
      "TG A",
      "AG A",
      "ĠCAS I",
      "ĠCAIS ES",
      "T Q",
      "ĠCS G",
      "ĠCASS EG",
      "RD RG",
      "E N",
      "TG S",
      "V F",
      "R W",
      "ĠCASS W",
      "ĠCASS VG",
      "ĠCASS PL",
      "E F",
      "K I",
      "E Y",
      "R EG",
      "ĠCSA G",
      "GG L",
      "P PG",
      "TG L",
      "R H",
      "Q I",
      "P RG",
      "R RG",
      "P W",
      "T H",
      "V K",
      "M A",
      "P DTQYF",
      "S GG",
      "TG V",
      "AG ELFF",
      "ĠCASS K",
      "R TDTQYF",
      "W A",
      "RT SG",
      "AG V",
      "ĠCASSF G",
      "E GG",
      "E T",
      "RD G",
      "RG L",
      "ĠCAS A",
      "RG A",
      "Y I",
      "M S",
      "Q K",
      "R SG",
      "ĠCA G",
      "TG D",
      "PL G",
      "ĠCSA RA",
      "ĠCASSL L",
      "Y V",
      "ĠCASS EA",
      "ĠCSA RV",
      "T YNEQFF",
      "A I",
      "VL G",
      "RD S",
      "D NEQFF",
      "RG S",
      "D F",
      "C L",
      "W S",
      "D GYTF",
      "W L",
      "I F",
      "GG YTF",
      "R PG",
      "D V",
      "YS NQPQHF",
      "A FF",
      "ĠCASSL GG",
      "Q E",
      "R EQYF",
      "ĠCASS RG",
      "Ġ LL",
      "AG L",
      "P TG",
      "ĠCASSQ E",
      "QG S",
      "I K",
      "I V",
      "D Y",
      "RA L",
      "M V",
      "A SG",
      "Q N",
      "R DTQYF",
      "PG L",
      "AN TGELFF"
    ]
  }
}